# Data Preprocessing
* I. Missing Value
* II. apply( )
* III. Filtering
* IV. 데이터프레임 합치기
* V. 그룹 연산
* VI. Multi-Index
* VII. pivot_table( )

#  1, Missing Value(결측치)

## 1) 실습용 'titanic' 데이터셋

### 'age'및 'deck' 열에서 결측치(NaN)확인

In [1]:
import seaborn as sns
DF = sns.load_dataset('titanic')

DF.head(10)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True
5         0       3    male   NaN  ...   NaN   Queenstown     no   True
6         0       1    male  54.0  ...     E  Southampton     no   True
7         0       3    male   2.0  ...   NaN  Southampton     no  False
8         1       3  female  27.0  ...   NaN  Southampton    yes  False
9         1       2  female  14.0  ...   NaN    Cherbourg    yes  False

[10 rows x 15 columns]

In [2]:
DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

## 2) 결측치 확인

### .value_counts(dropna = False)

#### 결측치를 포함하여 결과 출력

In [3]:
DF['deck'].value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

### .isnull()

#### 결측치(NAN)를 'True'로 출력

In [6]:
DF.head(10).isnull()

   survived  pclass    sex    age  ...   deck  embark_town  alive  alone
0     False   False  False  False  ...   True        False  False  False
1     False   False  False  False  ...  False        False  False  False
2     False   False  False  False  ...   True        False  False  False
3     False   False  False  False  ...  False        False  False  False
4     False   False  False  False  ...   True        False  False  False
5     False   False  False   True  ...   True        False  False  False
6     False   False  False  False  ...  False        False  False  False
7     False   False  False  False  ...   True        False  False  False
8     False   False  False  False  ...   True        False  False  False
9     False   False  False  False  ...   True        False  False  False

[10 rows x 15 columns]

### .isnull().sum(axis=0)

#### 각 열별로 결측치 개수 확인

In [7]:
DF.isnull().sum(axis=0)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

### .notnull()

####   결측치를 'False'로 출력

In [8]:
DF.head(10).notnull()

   survived  pclass   sex    age  ...   deck  embark_town  alive  alone
0      True    True  True   True  ...  False         True   True   True
1      True    True  True   True  ...   True         True   True   True
2      True    True  True   True  ...  False         True   True   True
3      True    True  True   True  ...   True         True   True   True
4      True    True  True   True  ...  False         True   True   True
5      True    True  True  False  ...  False         True   True   True
6      True    True  True   True  ...   True         True   True   True
7      True    True  True   True  ...  False         True   True   True
8      True    True  True   True  ...  False         True   True   True
9      True    True  True   True  ...  False         True   True   True

[10 rows x 15 columns]

In [9]:
DF.notnull().sum(axis=0)

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

## 3) 결측치 삭제

### 결측치가 300개 이상인 열 삭제

#### .dropna(thresh = 300, axis =1)

In [10]:
DF.isnull().sum(axis = 0)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [11]:
DF.dropna(thresh=300, axis = 1).shape

(891, 14)

#### .dropna(subset=['age'], how = 'any', axis = 0)

In [12]:
DF.shape

(891, 15)

In [13]:
DF.dropna(subset=['age'], how='any', axis=0).shape

(714, 15)

In [16]:
DF.dropna(subset=['age','deck'], how='any', axis=0).shape

(184, 15)

## 4) 격측치 치환

### 연속형 데이터 치환

#### .fillna(int(DF['age'].mean(axis = 0)), inplace = True)

In [19]:
DF['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [20]:
DF['age'].fillna(int(DF['age'].mean(axis=0)), inplace=True)

In [21]:
DF['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    29.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

### 명목형 데이터 치환

#### .fillna(most_freq, inplace=True)

In [22]:
DF['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [28]:
most_freq = DF['embark_town'].value_counts(dropna=True)
most_freq

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [29]:
most_freq = DF['embark_town'].value_counts(dropna=False)
most_freq

Southampton    644
Cherbourg      168
Queenstown      77
NaN              2
Name: embark_town, dtype: int64

In [30]:
most_freq = DF['embark_town'].value_counts(dropna=True).idxmax()
most_freq

'Southampton'

In [31]:
DF['embark_town'].fillna(most_freq, inplace=True)

In [33]:
DF['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

### 결측치 치환

#### .fillna(method='ffill'/'bfill', inplace=True)

In [34]:
DF= sns.load_dataset('titanic')

In [35]:
DF['embark_town'][828:831]

828    Queenstown
829           NaN
830     Cherbourg
Name: embark_town, dtype: object

In [37]:
DF['embark_town'].fillna(method='ffill', inplace=True)
DF['embark_town'][828:831]

828    Queenstown
829    Queenstown
830     Cherbourg
Name: embark_town, dtype: object

In [40]:
DF= sns.load_dataset('titanic')

In [41]:
DF['embark_town'].fillna(method='bfill', inplace=True)
DF['embark_town'][828:831]

828    Queenstown
829     Cherbourg
830     Cherbourg
Name: embark_town, dtype: object

In [42]:
print(type(DF['embark_town']))

<class 'pandas.core.series.Series'>

# 2, apply() <p> - 시리즈나 데이터프레임 구조에 함수를 매핑

## 1) 실습용 'titanic' 데이터 셋 <p> DF = titanic.loc[ : , [ 'age' , 'fare' ]].head(5)

In [44]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

DF=titanic.loc[:,['age','fare']].head(5)
DF

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

## 2) apply(axis = 0) <p> - sum() 함수를 행 방향으로 매핑

In [45]:
DF.apply(sum, axis = 0)

age     156.0000
fare    147.6083
dtype: float64

In [46]:
DF.sum(axis = 0)

age     156.0000
fare    147.6083
dtype: float64

In [47]:
DF.apply(sum, axis=1)

0     29.2500
1    109.2833
2     33.9250
3     88.1000
4     43.0500
dtype: float64

In [48]:
DF.sum(axis=1)

0     29.2500
1    109.2833
2     33.9250
3     88.1000
4     43.0500
dtype: float64

# 3, Filtering

## 1) 실습용 'titanic' 데이터 셋

## 2) 'age'가 10살 이상이면서 20살 미만

In [60]:
'''import seaborn as sns
titanic = sns.load_dataset('titanic')

titanic.head(3)'''

import pandas as pd
titanic = pd.read_csv('titanic.csv')
titanic.head(3)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True

[3 rows x 15 columns]

In [61]:
Filter_1 = (titanic.age>=10) & (titanic.age<20)
titanic.loc[Filter_1,:].head()

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
9          1       2  female  14.0  ...   NaN    Cherbourg    yes  False
14         0       3  female  14.0  ...   NaN  Southampton     no   True
22         1       3  female  15.0  ...   NaN   Queenstown    yes   True
27         0       1    male  19.0  ...     C  Southampton     no  False
38         0       3  female  18.0  ...   NaN  Southampton     no  False

[5 rows x 15 columns]

## 3) 'age'가 10살 미만이면서 'sex'이 여자

In [62]:
Filter_2 = (titanic.age<10) & (titanic.sex=='female')
titanic.loc[Filter_2,:].head(3)

    survived  pclass     sex  age  ...  deck  embark_town  alive  alone
10         1       3  female  4.0  ...     G  Southampton    yes  False
24         0       3  female  8.0  ...   NaN  Southampton     no  False
43         1       2  female  3.0  ...   NaN    Cherbourg    yes  False

[3 rows x 15 columns]